In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [101]:
df_clientes = pd.read_excel('prueba_inner_1.xlsx', index_col=None)
df_salarios = pd.read_excel('prueba_inner_2.xlsx', index_col=None)

In [103]:
df_clientes.head()

   id nombres apellidos
0   1       a         t
1   2       b         s
2   3       c         r
3   4       d         q
4   5       e         p

In [105]:
df_salarios.head()

   id  edad  salario
0   1    20      100
1   2    21      200
2   3    22      300
3   4    23      400
4   5    24      500

## INNER JOIN

Nos devuelve la unión de las tablas por la columna indicada, mostrando solo los valores coincidentes

In [107]:
### Inner Join
inner_join = df_clientes.merge(df_salarios, how="inner", on='id')

In [109]:
inner_join.head()

   id nombres apellidos  edad  salario
0   1       a         t    20      100
1   2       b         s    21      200
2   3       c         r    22      300
3   4       d         q    23      400
4   5       e         p    24      500

## OUTER JOIN

Nos devuelve las uniones de ñas tabñas por la colua común indicada, independiente de que los valores coincidan o no

In [111]:
### Outer Join
outer_join = df_clientes.merge(df_salarios, how="outer", on='id')

In [113]:
outer_join.head()

   id nombres apellidos  edad  salario
0   1       a         t    20      100
1   2       b         s    21      200
2   3       c         r    22      300
3   4       d         q    23      400
4   5       e         p    24      500

## LEFT JOIN

Nos devuelve la unión de las tablas manteniendo exclusivamente los valores de la tabla que pasamos a la izquierda

In [115]:
## Left join
left_join = df_clientes.merge(df_salarios, how="left", on='id')

In [117]:
left_join.head()

   id nombres apellidos  edad  salario
0   1       a         t    20      100
1   2       b         s    21      200
2   3       c         r    22      300
3   4       d         q    23      400
4   5       e         p    24      500

## RIGHT JOIN

Nos devuelve la unión de las tablas manteniendo exclusivamente los valores de la tabla que pasamos a la derecha

In [119]:
## Right join
right_join = df_clientes.merge(df_salarios, how="right", on='id')

In [121]:
right_join.head()

   id nombres apellidos  edad  salario
0   1       a         t    20      100
1   2       b         s    21      200
2   3       c         r    22      300
3   4       d         q    23      400
4   5       e         p    24      500